// Generated by jextract

package org.sireum.ffm.ros.humble;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rcl_variant_s {
 *     bool *bool_value;
 *     int64_t *integer_value;
 *     double *double_value;
 *     char *string_value;
 *     rcl_byte_array_t *byte_array_value;
 *     rcl_bool_array_t *bool_array_value;
 *     rcl_int64_array_t *integer_array_value;
 *     rcl_double_array_t *double_array_value;
 *     rcutils_string_array_t *string_array_value;
 * }
 * }
 */
public class rcl_variant_s {

    rcl_variant_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        gen_h.C_POINTER.withName("bool_value"),
        gen_h.C_POINTER.withName("integer_value"),
        gen_h.C_POINTER.withName("double_value"),
        gen_h.C_POINTER.withName("string_value"),
        gen_h.C_POINTER.withName("byte_array_value"),
        gen_h.C_POINTER.withName("bool_array_value"),
        gen_h.C_POINTER.withName("integer_array_value"),
        gen_h.C_POINTER.withName("double_array_value"),
        gen_h.C_POINTER.withName("string_array_value")
    ).withName("rcl_variant_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout bool_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("bool_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool *bool_value
     * }
     */
    public static final AddressLayout bool_value$layout() {
        return bool_value$LAYOUT;
    }

    private static final long bool_value$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool *bool_value
     * }
     */
    public static final long bool_value$offset() {
        return bool_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool *bool_value
     * }
     */
    public static MemorySegment bool_value(MemorySegment struct) {
        return struct.get(bool_value$LAYOUT, bool_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool *bool_value
     * }
     */
    public static void bool_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(bool_value$LAYOUT, bool_value$OFFSET, fieldValue);
    }

    private static final AddressLayout integer_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("integer_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * int64_t *integer_value
     * }
     */
    public static final AddressLayout integer_value$layout() {
        return integer_value$LAYOUT;
    }

    private static final long integer_value$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * int64_t *integer_value
     * }
     */
    public static final long integer_value$offset() {
        return integer_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * int64_t *integer_value
     * }
     */
    public static MemorySegment integer_value(MemorySegment struct) {
        return struct.get(integer_value$LAYOUT, integer_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * int64_t *integer_value
     * }
     */
    public static void integer_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(integer_value$LAYOUT, integer_value$OFFSET, fieldValue);
    }

    private static final AddressLayout double_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("double_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * double *double_value
     * }
     */
    public static final AddressLayout double_value$layout() {
        return double_value$LAYOUT;
    }

    private static final long double_value$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * double *double_value
     * }
     */
    public static final long double_value$offset() {
        return double_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * double *double_value
     * }
     */
    public static MemorySegment double_value(MemorySegment struct) {
        return struct.get(double_value$LAYOUT, double_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * double *double_value
     * }
     */
    public static void double_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(double_value$LAYOUT, double_value$OFFSET, fieldValue);
    }

    private static final AddressLayout string_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("string_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *string_value
     * }
     */
    public static final AddressLayout string_value$layout() {
        return string_value$LAYOUT;
    }

    private static final long string_value$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *string_value
     * }
     */
    public static final long string_value$offset() {
        return string_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *string_value
     * }
     */
    public static MemorySegment string_value(MemorySegment struct) {
        return struct.get(string_value$LAYOUT, string_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *string_value
     * }
     */
    public static void string_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(string_value$LAYOUT, string_value$OFFSET, fieldValue);
    }

    private static final AddressLayout byte_array_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("byte_array_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcl_byte_array_t *byte_array_value
     * }
     */
    public static final AddressLayout byte_array_value$layout() {
        return byte_array_value$LAYOUT;
    }

    private static final long byte_array_value$OFFSET = 32;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcl_byte_array_t *byte_array_value
     * }
     */
    public static final long byte_array_value$offset() {
        return byte_array_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcl_byte_array_t *byte_array_value
     * }
     */
    public static MemorySegment byte_array_value(MemorySegment struct) {
        return struct.get(byte_array_value$LAYOUT, byte_array_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcl_byte_array_t *byte_array_value
     * }
     */
    public static void byte_array_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(byte_array_value$LAYOUT, byte_array_value$OFFSET, fieldValue);
    }

    private static final AddressLayout bool_array_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("bool_array_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcl_bool_array_t *bool_array_value
     * }
     */
    public static final AddressLayout bool_array_value$layout() {
        return bool_array_value$LAYOUT;
    }

    private static final long bool_array_value$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcl_bool_array_t *bool_array_value
     * }
     */
    public static final long bool_array_value$offset() {
        return bool_array_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcl_bool_array_t *bool_array_value
     * }
     */
    public static MemorySegment bool_array_value(MemorySegment struct) {
        return struct.get(bool_array_value$LAYOUT, bool_array_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcl_bool_array_t *bool_array_value
     * }
     */
    public static void bool_array_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(bool_array_value$LAYOUT, bool_array_value$OFFSET, fieldValue);
    }

    private static final AddressLayout integer_array_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("integer_array_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcl_int64_array_t *integer_array_value
     * }
     */
    public static final AddressLayout integer_array_value$layout() {
        return integer_array_value$LAYOUT;
    }

    private static final long integer_array_value$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcl_int64_array_t *integer_array_value
     * }
     */
    public static final long integer_array_value$offset() {
        return integer_array_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcl_int64_array_t *integer_array_value
     * }
     */
    public static MemorySegment integer_array_value(MemorySegment struct) {
        return struct.get(integer_array_value$LAYOUT, integer_array_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcl_int64_array_t *integer_array_value
     * }
     */
    public static void integer_array_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(integer_array_value$LAYOUT, integer_array_value$OFFSET, fieldValue);
    }

    private static final AddressLayout double_array_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("double_array_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcl_double_array_t *double_array_value
     * }
     */
    public static final AddressLayout double_array_value$layout() {
        return double_array_value$LAYOUT;
    }

    private static final long double_array_value$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcl_double_array_t *double_array_value
     * }
     */
    public static final long double_array_value$offset() {
        return double_array_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcl_double_array_t *double_array_value
     * }
     */
    public static MemorySegment double_array_value(MemorySegment struct) {
        return struct.get(double_array_value$LAYOUT, double_array_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcl_double_array_t *double_array_value
     * }
     */
    public static void double_array_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(double_array_value$LAYOUT, double_array_value$OFFSET, fieldValue);
    }

    private static final AddressLayout string_array_value$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("string_array_value"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcutils_string_array_t *string_array_value
     * }
     */
    public static final AddressLayout string_array_value$layout() {
        return string_array_value$LAYOUT;
    }

    private static final long string_array_value$OFFSET = 64;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcutils_string_array_t *string_array_value
     * }
     */
    public static final long string_array_value$offset() {
        return string_array_value$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcutils_string_array_t *string_array_value
     * }
     */
    public static MemorySegment string_array_value(MemorySegment struct) {
        return struct.get(string_array_value$LAYOUT, string_array_value$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcutils_string_array_t *string_array_value
     * }
     */
    public static void string_array_value(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(string_array_value$LAYOUT, string_array_value$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

