// Generated by jextract

package org.sireum.ffm.ros.humble;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rmw_subscription_options_s {
 *     void *rmw_specific_subscription_payload;
 *     bool ignore_local_publications;
 *     rmw_unique_network_flow_endpoints_requirement_t require_unique_network_flow_endpoints;
 *     rmw_subscription_content_filter_options_t *content_filter_options;
 * }
 * }
 */
public class rmw_subscription_options_s {

    rmw_subscription_options_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        gen_h.C_POINTER.withName("rmw_specific_subscription_payload"),
        gen_h.C_BOOL.withName("ignore_local_publications"),
        MemoryLayout.paddingLayout(3),
        gen_h.C_INT.withName("require_unique_network_flow_endpoints"),
        gen_h.C_POINTER.withName("content_filter_options")
    ).withName("rmw_subscription_options_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout rmw_specific_subscription_payload$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("rmw_specific_subscription_payload"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *rmw_specific_subscription_payload
     * }
     */
    public static final AddressLayout rmw_specific_subscription_payload$layout() {
        return rmw_specific_subscription_payload$LAYOUT;
    }

    private static final long rmw_specific_subscription_payload$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *rmw_specific_subscription_payload
     * }
     */
    public static final long rmw_specific_subscription_payload$offset() {
        return rmw_specific_subscription_payload$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *rmw_specific_subscription_payload
     * }
     */
    public static MemorySegment rmw_specific_subscription_payload(MemorySegment struct) {
        return struct.get(rmw_specific_subscription_payload$LAYOUT, rmw_specific_subscription_payload$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *rmw_specific_subscription_payload
     * }
     */
    public static void rmw_specific_subscription_payload(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(rmw_specific_subscription_payload$LAYOUT, rmw_specific_subscription_payload$OFFSET, fieldValue);
    }

    private static final OfBoolean ignore_local_publications$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("ignore_local_publications"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool ignore_local_publications
     * }
     */
    public static final OfBoolean ignore_local_publications$layout() {
        return ignore_local_publications$LAYOUT;
    }

    private static final long ignore_local_publications$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool ignore_local_publications
     * }
     */
    public static final long ignore_local_publications$offset() {
        return ignore_local_publications$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool ignore_local_publications
     * }
     */
    public static boolean ignore_local_publications(MemorySegment struct) {
        return struct.get(ignore_local_publications$LAYOUT, ignore_local_publications$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool ignore_local_publications
     * }
     */
    public static void ignore_local_publications(MemorySegment struct, boolean fieldValue) {
        struct.set(ignore_local_publications$LAYOUT, ignore_local_publications$OFFSET, fieldValue);
    }

    private static final OfInt require_unique_network_flow_endpoints$LAYOUT = (OfInt)$LAYOUT.select(groupElement("require_unique_network_flow_endpoints"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_unique_network_flow_endpoints_requirement_t require_unique_network_flow_endpoints
     * }
     */
    public static final OfInt require_unique_network_flow_endpoints$layout() {
        return require_unique_network_flow_endpoints$LAYOUT;
    }

    private static final long require_unique_network_flow_endpoints$OFFSET = 12;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_unique_network_flow_endpoints_requirement_t require_unique_network_flow_endpoints
     * }
     */
    public static final long require_unique_network_flow_endpoints$offset() {
        return require_unique_network_flow_endpoints$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_unique_network_flow_endpoints_requirement_t require_unique_network_flow_endpoints
     * }
     */
    public static int require_unique_network_flow_endpoints(MemorySegment struct) {
        return struct.get(require_unique_network_flow_endpoints$LAYOUT, require_unique_network_flow_endpoints$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_unique_network_flow_endpoints_requirement_t require_unique_network_flow_endpoints
     * }
     */
    public static void require_unique_network_flow_endpoints(MemorySegment struct, int fieldValue) {
        struct.set(require_unique_network_flow_endpoints$LAYOUT, require_unique_network_flow_endpoints$OFFSET, fieldValue);
    }

    private static final AddressLayout content_filter_options$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("content_filter_options"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_subscription_content_filter_options_t *content_filter_options
     * }
     */
    public static final AddressLayout content_filter_options$layout() {
        return content_filter_options$LAYOUT;
    }

    private static final long content_filter_options$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_subscription_content_filter_options_t *content_filter_options
     * }
     */
    public static final long content_filter_options$offset() {
        return content_filter_options$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_subscription_content_filter_options_t *content_filter_options
     * }
     */
    public static MemorySegment content_filter_options(MemorySegment struct) {
        return struct.get(content_filter_options$LAYOUT, content_filter_options$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_subscription_content_filter_options_t *content_filter_options
     * }
     */
    public static void content_filter_options(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(content_filter_options$LAYOUT, content_filter_options$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

