// Generated by jextract

package org.sireum.ffm.ros.humble;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rmw_context_s {
 *     uint64_t instance_id;
 *     const char *implementation_identifier;
 *     rmw_init_options_t options;
 *     size_t actual_domain_id;
 *     rmw_context_impl_t *impl;
 * }
 * }
 */
public class rmw_context_s {

    rmw_context_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        gen_h.C_LONG.withName("instance_id"),
        gen_h.C_POINTER.withName("implementation_identifier"),
        rmw_init_options_s.layout().withName("options"),
        gen_h.C_LONG.withName("actual_domain_id"),
        gen_h.C_POINTER.withName("impl")
    ).withName("rmw_context_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong instance_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("instance_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static final OfLong instance_id$layout() {
        return instance_id$LAYOUT;
    }

    private static final long instance_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static final long instance_id$offset() {
        return instance_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static long instance_id(MemorySegment struct) {
        return struct.get(instance_id$LAYOUT, instance_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static void instance_id(MemorySegment struct, long fieldValue) {
        struct.set(instance_id$LAYOUT, instance_id$OFFSET, fieldValue);
    }

    private static final AddressLayout implementation_identifier$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("implementation_identifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final AddressLayout implementation_identifier$layout() {
        return implementation_identifier$LAYOUT;
    }

    private static final long implementation_identifier$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final long implementation_identifier$offset() {
        return implementation_identifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static MemorySegment implementation_identifier(MemorySegment struct) {
        return struct.get(implementation_identifier$LAYOUT, implementation_identifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static void implementation_identifier(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(implementation_identifier$LAYOUT, implementation_identifier$OFFSET, fieldValue);
    }

    private static final GroupLayout options$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("options"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_init_options_t options
     * }
     */
    public static final GroupLayout options$layout() {
        return options$LAYOUT;
    }

    private static final long options$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_init_options_t options
     * }
     */
    public static final long options$offset() {
        return options$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_init_options_t options
     * }
     */
    public static MemorySegment options(MemorySegment struct) {
        return struct.asSlice(options$OFFSET, options$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_init_options_t options
     * }
     */
    public static void options(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, options$OFFSET, options$LAYOUT.byteSize());
    }

    private static final OfLong actual_domain_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("actual_domain_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t actual_domain_id
     * }
     */
    public static final OfLong actual_domain_id$layout() {
        return actual_domain_id$LAYOUT;
    }

    private static final long actual_domain_id$OFFSET = 120;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t actual_domain_id
     * }
     */
    public static final long actual_domain_id$offset() {
        return actual_domain_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t actual_domain_id
     * }
     */
    public static long actual_domain_id(MemorySegment struct) {
        return struct.get(actual_domain_id$LAYOUT, actual_domain_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t actual_domain_id
     * }
     */
    public static void actual_domain_id(MemorySegment struct, long fieldValue) {
        struct.set(actual_domain_id$LAYOUT, actual_domain_id$OFFSET, fieldValue);
    }

    private static final AddressLayout impl$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("impl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_context_impl_t *impl
     * }
     */
    public static final AddressLayout impl$layout() {
        return impl$LAYOUT;
    }

    private static final long impl$OFFSET = 128;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_context_impl_t *impl
     * }
     */
    public static final long impl$offset() {
        return impl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_context_impl_t *impl
     * }
     */
    public static MemorySegment impl(MemorySegment struct) {
        return struct.get(impl$LAYOUT, impl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_context_impl_t *impl
     * }
     */
    public static void impl(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(impl$LAYOUT, impl$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

