// Generated by jextract

package org.sireum.ffm.ros.humble;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rmw_subscription_s {
 *     const char *implementation_identifier;
 *     void *data;
 *     const char *topic_name;
 *     rmw_subscription_options_t options;
 *     bool can_loan_messages;
 *     bool is_cft_enabled;
 * }
 * }
 */
public class rmw_subscription_s {

    rmw_subscription_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        gen_h.C_POINTER.withName("implementation_identifier"),
        gen_h.C_POINTER.withName("data"),
        gen_h.C_POINTER.withName("topic_name"),
        rmw_subscription_options_s.layout().withName("options"),
        gen_h.C_BOOL.withName("can_loan_messages"),
        gen_h.C_BOOL.withName("is_cft_enabled"),
        MemoryLayout.paddingLayout(6)
    ).withName("rmw_subscription_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final AddressLayout implementation_identifier$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("implementation_identifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final AddressLayout implementation_identifier$layout() {
        return implementation_identifier$LAYOUT;
    }

    private static final long implementation_identifier$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final long implementation_identifier$offset() {
        return implementation_identifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static MemorySegment implementation_identifier(MemorySegment struct) {
        return struct.get(implementation_identifier$LAYOUT, implementation_identifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static void implementation_identifier(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(implementation_identifier$LAYOUT, implementation_identifier$OFFSET, fieldValue);
    }

    private static final AddressLayout data$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("data"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final AddressLayout data$layout() {
        return data$LAYOUT;
    }

    private static final long data$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static final long data$offset() {
        return data$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static MemorySegment data(MemorySegment struct) {
        return struct.get(data$LAYOUT, data$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * void *data
     * }
     */
    public static void data(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(data$LAYOUT, data$OFFSET, fieldValue);
    }

    private static final AddressLayout topic_name$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("topic_name"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *topic_name
     * }
     */
    public static final AddressLayout topic_name$layout() {
        return topic_name$LAYOUT;
    }

    private static final long topic_name$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *topic_name
     * }
     */
    public static final long topic_name$offset() {
        return topic_name$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *topic_name
     * }
     */
    public static MemorySegment topic_name(MemorySegment struct) {
        return struct.get(topic_name$LAYOUT, topic_name$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *topic_name
     * }
     */
    public static void topic_name(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(topic_name$LAYOUT, topic_name$OFFSET, fieldValue);
    }

    private static final GroupLayout options$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("options"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_subscription_options_t options
     * }
     */
    public static final GroupLayout options$layout() {
        return options$LAYOUT;
    }

    private static final long options$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_subscription_options_t options
     * }
     */
    public static final long options$offset() {
        return options$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_subscription_options_t options
     * }
     */
    public static MemorySegment options(MemorySegment struct) {
        return struct.asSlice(options$OFFSET, options$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_subscription_options_t options
     * }
     */
    public static void options(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, options$OFFSET, options$LAYOUT.byteSize());
    }

    private static final OfBoolean can_loan_messages$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("can_loan_messages"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool can_loan_messages
     * }
     */
    public static final OfBoolean can_loan_messages$layout() {
        return can_loan_messages$LAYOUT;
    }

    private static final long can_loan_messages$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool can_loan_messages
     * }
     */
    public static final long can_loan_messages$offset() {
        return can_loan_messages$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool can_loan_messages
     * }
     */
    public static boolean can_loan_messages(MemorySegment struct) {
        return struct.get(can_loan_messages$LAYOUT, can_loan_messages$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool can_loan_messages
     * }
     */
    public static void can_loan_messages(MemorySegment struct, boolean fieldValue) {
        struct.set(can_loan_messages$LAYOUT, can_loan_messages$OFFSET, fieldValue);
    }

    private static final OfBoolean is_cft_enabled$LAYOUT = (OfBoolean)$LAYOUT.select(groupElement("is_cft_enabled"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * bool is_cft_enabled
     * }
     */
    public static final OfBoolean is_cft_enabled$layout() {
        return is_cft_enabled$LAYOUT;
    }

    private static final long is_cft_enabled$OFFSET = 49;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * bool is_cft_enabled
     * }
     */
    public static final long is_cft_enabled$offset() {
        return is_cft_enabled$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * bool is_cft_enabled
     * }
     */
    public static boolean is_cft_enabled(MemorySegment struct) {
        return struct.get(is_cft_enabled$LAYOUT, is_cft_enabled$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * bool is_cft_enabled
     * }
     */
    public static void is_cft_enabled(MemorySegment struct, boolean fieldValue) {
        struct.set(is_cft_enabled$LAYOUT, is_cft_enabled$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

