// Generated by jextract

package org.sireum.ffm.ros.humble;

import java.lang.invoke.*;
import java.lang.foreign.*;
import java.nio.ByteOrder;
import java.util.*;
import java.util.function.*;
import java.util.stream.*;

import static java.lang.foreign.ValueLayout.*;
import static java.lang.foreign.MemoryLayout.PathElement.*;

/**
 * {@snippet lang=c :
 * struct rmw_init_options_s {
 *     uint64_t instance_id;
 *     const char *implementation_identifier;
 *     size_t domain_id;
 *     rmw_security_options_t security_options;
 *     rmw_localhost_only_t localhost_only;
 *     char *enclave;
 *     rcutils_allocator_t allocator;
 *     rmw_init_options_impl_t *impl;
 * }
 * }
 */
public class rmw_init_options_s {

    rmw_init_options_s() {
        // Should not be called directly
    }

    private static final GroupLayout $LAYOUT = MemoryLayout.structLayout(
        gen_h.C_LONG.withName("instance_id"),
        gen_h.C_POINTER.withName("implementation_identifier"),
        gen_h.C_LONG.withName("domain_id"),
        rmw_security_options_s.layout().withName("security_options"),
        gen_h.C_INT.withName("localhost_only"),
        MemoryLayout.paddingLayout(4),
        gen_h.C_POINTER.withName("enclave"),
        rcutils_allocator_s.layout().withName("allocator"),
        gen_h.C_POINTER.withName("impl")
    ).withName("rmw_init_options_s");

    /**
     * The layout of this struct
     */
    public static final GroupLayout layout() {
        return $LAYOUT;
    }

    private static final OfLong instance_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("instance_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static final OfLong instance_id$layout() {
        return instance_id$LAYOUT;
    }

    private static final long instance_id$OFFSET = 0;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static final long instance_id$offset() {
        return instance_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static long instance_id(MemorySegment struct) {
        return struct.get(instance_id$LAYOUT, instance_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * uint64_t instance_id
     * }
     */
    public static void instance_id(MemorySegment struct, long fieldValue) {
        struct.set(instance_id$LAYOUT, instance_id$OFFSET, fieldValue);
    }

    private static final AddressLayout implementation_identifier$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("implementation_identifier"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final AddressLayout implementation_identifier$layout() {
        return implementation_identifier$LAYOUT;
    }

    private static final long implementation_identifier$OFFSET = 8;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static final long implementation_identifier$offset() {
        return implementation_identifier$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static MemorySegment implementation_identifier(MemorySegment struct) {
        return struct.get(implementation_identifier$LAYOUT, implementation_identifier$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * const char *implementation_identifier
     * }
     */
    public static void implementation_identifier(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(implementation_identifier$LAYOUT, implementation_identifier$OFFSET, fieldValue);
    }

    private static final OfLong domain_id$LAYOUT = (OfLong)$LAYOUT.select(groupElement("domain_id"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * size_t domain_id
     * }
     */
    public static final OfLong domain_id$layout() {
        return domain_id$LAYOUT;
    }

    private static final long domain_id$OFFSET = 16;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * size_t domain_id
     * }
     */
    public static final long domain_id$offset() {
        return domain_id$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * size_t domain_id
     * }
     */
    public static long domain_id(MemorySegment struct) {
        return struct.get(domain_id$LAYOUT, domain_id$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * size_t domain_id
     * }
     */
    public static void domain_id(MemorySegment struct, long fieldValue) {
        struct.set(domain_id$LAYOUT, domain_id$OFFSET, fieldValue);
    }

    private static final GroupLayout security_options$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("security_options"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_security_options_t security_options
     * }
     */
    public static final GroupLayout security_options$layout() {
        return security_options$LAYOUT;
    }

    private static final long security_options$OFFSET = 24;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_security_options_t security_options
     * }
     */
    public static final long security_options$offset() {
        return security_options$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_security_options_t security_options
     * }
     */
    public static MemorySegment security_options(MemorySegment struct) {
        return struct.asSlice(security_options$OFFSET, security_options$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_security_options_t security_options
     * }
     */
    public static void security_options(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, security_options$OFFSET, security_options$LAYOUT.byteSize());
    }

    private static final OfInt localhost_only$LAYOUT = (OfInt)$LAYOUT.select(groupElement("localhost_only"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_localhost_only_t localhost_only
     * }
     */
    public static final OfInt localhost_only$layout() {
        return localhost_only$LAYOUT;
    }

    private static final long localhost_only$OFFSET = 40;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_localhost_only_t localhost_only
     * }
     */
    public static final long localhost_only$offset() {
        return localhost_only$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_localhost_only_t localhost_only
     * }
     */
    public static int localhost_only(MemorySegment struct) {
        return struct.get(localhost_only$LAYOUT, localhost_only$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_localhost_only_t localhost_only
     * }
     */
    public static void localhost_only(MemorySegment struct, int fieldValue) {
        struct.set(localhost_only$LAYOUT, localhost_only$OFFSET, fieldValue);
    }

    private static final AddressLayout enclave$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("enclave"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * char *enclave
     * }
     */
    public static final AddressLayout enclave$layout() {
        return enclave$LAYOUT;
    }

    private static final long enclave$OFFSET = 48;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * char *enclave
     * }
     */
    public static final long enclave$offset() {
        return enclave$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * char *enclave
     * }
     */
    public static MemorySegment enclave(MemorySegment struct) {
        return struct.get(enclave$LAYOUT, enclave$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * char *enclave
     * }
     */
    public static void enclave(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(enclave$LAYOUT, enclave$OFFSET, fieldValue);
    }

    private static final GroupLayout allocator$LAYOUT = (GroupLayout)$LAYOUT.select(groupElement("allocator"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rcutils_allocator_t allocator
     * }
     */
    public static final GroupLayout allocator$layout() {
        return allocator$LAYOUT;
    }

    private static final long allocator$OFFSET = 56;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rcutils_allocator_t allocator
     * }
     */
    public static final long allocator$offset() {
        return allocator$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rcutils_allocator_t allocator
     * }
     */
    public static MemorySegment allocator(MemorySegment struct) {
        return struct.asSlice(allocator$OFFSET, allocator$LAYOUT.byteSize());
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rcutils_allocator_t allocator
     * }
     */
    public static void allocator(MemorySegment struct, MemorySegment fieldValue) {
        MemorySegment.copy(fieldValue, 0L, struct, allocator$OFFSET, allocator$LAYOUT.byteSize());
    }

    private static final AddressLayout impl$LAYOUT = (AddressLayout)$LAYOUT.select(groupElement("impl"));

    /**
     * Layout for field:
     * {@snippet lang=c :
     * rmw_init_options_impl_t *impl
     * }
     */
    public static final AddressLayout impl$layout() {
        return impl$LAYOUT;
    }

    private static final long impl$OFFSET = 96;

    /**
     * Offset for field:
     * {@snippet lang=c :
     * rmw_init_options_impl_t *impl
     * }
     */
    public static final long impl$offset() {
        return impl$OFFSET;
    }

    /**
     * Getter for field:
     * {@snippet lang=c :
     * rmw_init_options_impl_t *impl
     * }
     */
    public static MemorySegment impl(MemorySegment struct) {
        return struct.get(impl$LAYOUT, impl$OFFSET);
    }

    /**
     * Setter for field:
     * {@snippet lang=c :
     * rmw_init_options_impl_t *impl
     * }
     */
    public static void impl(MemorySegment struct, MemorySegment fieldValue) {
        struct.set(impl$LAYOUT, impl$OFFSET, fieldValue);
    }

    /**
     * Obtains a slice of {@code arrayParam} which selects the array element at {@code index}.
     * The returned segment has address {@code arrayParam.address() + index * layout().byteSize()}
     */
    public static MemorySegment asSlice(MemorySegment array, long index) {
        return array.asSlice(layout().byteSize() * index);
    }

    /**
     * The size (in bytes) of this struct
     */
    public static long sizeof() { return layout().byteSize(); }

    /**
     * Allocate a segment of size {@code layout().byteSize()} using {@code allocator}
     */
    public static MemorySegment allocate(SegmentAllocator allocator) {
        return allocator.allocate(layout());
    }

    /**
     * Allocate an array of size {@code elementCount} using {@code allocator}.
     * The returned segment has size {@code elementCount * layout().byteSize()}.
     */
    public static MemorySegment allocateArray(long elementCount, SegmentAllocator allocator) {
        return allocator.allocate(MemoryLayout.sequenceLayout(elementCount, layout()));
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, Arena arena, Consumer<MemorySegment> cleanup) {
        return reinterpret(addr, 1, arena, cleanup);
    }

    /**
     * Reinterprets {@code addr} using target {@code arena} and {@code cleanupAction) (if any).
     * The returned segment has size {@code elementCount * layout().byteSize()}
     */
    public static MemorySegment reinterpret(MemorySegment addr, long elementCount, Arena arena, Consumer<MemorySegment> cleanup) {
        return addr.reinterpret(layout().byteSize() * elementCount, arena, cleanup);
    }
}

